In [44]:
from sqlalchemy import create_engine
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

In [2]:
database_name = 'scooters'    # Fill this in with your scooter database name

connection_string = f"postgresql://postgres:postgres@localhost:5432/{database_name}"

In [3]:
engine = create_engine(connection_string)

As you know, it's important to gain an understanding of new datasets before diving headlong into analysis. Here are some suggestions for guiding the process of getting to know the data contained in these tables:
- Are there any null values in any columns in either table?
- What date range is represented in each of the date columns? Investigate any values that seem odd.
- Is time represented with am/pm or using 24 hour values in each of the columns that include time?
- What values are there in the sumdgroup column? Are there any that are not of interest for this project?
- What are the minimum and maximum values for all the latitude and longitude columns? Do these ranges make sense, or is there anything surprising?
-What is the range of values for trip duration and trip distance? Do these values make sense? Explore values that might seem questionable.
- Check out how the values for the company name column in the scooters table compare to those of the trips table. What do you notice?

In [4]:
query = '''
SELECT COUNT(*)
FROM scooters
WHERE chargelevel IS NULL
'''

result = engine.execute(query)

In [5]:
result.fetchall()

[(770,)]

scooters: chargelevel has 770 nulls.

In [10]:
query = '''
SELECT MAX(tripduration),MIN(tripduration ) 
FROM trips
'''

result = engine.execute(query)

In [11]:
result.fetchall()

[(Decimal('512619.0'), Decimal('-19.3582666667'))]

In [12]:
query = '''
SELECT MAX(tripdistance),MIN(tripdistance) 
FROM trips
'''

result = engine.execute(query)

In [13]:
result.fetchall()

[(Decimal('31884482.6476'), Decimal('-20324803.8'))]

In [32]:
query = '''
SELECT pubdatetime
FROM scooters
LIMIT 2
'''

result = engine.execute(query)

In [33]:
result.fetchall()
pd.read_sql(query, con = engine)

              pubdatetime
0 2019-05-01 00:01:41.247
1 2019-05-01 00:01:41.247

1. During this period, seven companies offered scooters. How many scooters did each company have in this time frame? Did the number for each company change over time? Did scooter usage vary by company?

In [42]:
scooter_count = '''
SELECT DISTINCT companyname, COUNT(DISTINCT(sumdid)), MAX(pubdatetime), MIN(pubdatetime)
FROM scooters
GROUP BY companyname
'''

result = engine.execute(query)

In [43]:
result.fetchall()
pd.read_sql(scooter_count, con = engine)

  companyname  count                     max                     min
0        Bird   3860 2019-07-31 23:58:18.267 2019-05-01 00:01:41.247
1        Bolt    360 2019-07-31 23:59:57.000 2019-05-24 00:04:42.000
2      Gotcha    224 2019-07-31 23:59:15.753 2019-05-01 00:04:48.030
3        Jump   1210 2019-07-31 23:59:43.000 2019-05-16 22:12:12.000
4        Lime   1824 2019-07-31 23:56:08.147 2019-05-01 00:04:56.883
5        Lyft   1735 2019-07-31 23:58:32.950 2019-05-01 00:02:25.383
6        Spin    805 2019-07-31 23:55:54.303 2019-05-15 19:28:03.690

2. According to Second Substitute Bill BL2018-1202 (as amended) (https://web.archive.org/web/20181019234657/https://www.nashville.gov/Metro-Clerk/Legislative/Ordinances/Details/7d2cf076-b12c-4645-a118-b530577c5ee8/2015-2019/BL2018-1202.aspx), all permitted operators will first clean data before providing or reporting data to Metro. Data processing and cleaning shall include:  
* Removal of staff servicing and test trips  
* Removal of trips below one minute  
* Trip lengths are capped at 24 hours  
Are the scooter companies in compliance with the second and third part of this rule?